Revit 2027 API
BuiltInFailures.StructuralCustomConnectionFailures Class
 Failures about StructuralConnectionHandler.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.StructuralCustomConnectionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class StructuralCustomConnectionFailures
Public NotInheritable Class StructuralCustomConnectionFailures
public ref class StructuralCustomConnectionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type StructuralCustomConnectionFailures = class end
The BuiltInFailures.StructuralCustomConnectionFailures type exposes the following members.
Properties
Name | Description
SimpleConnectionTooFarRefs |  Simple Structural Connection Handler cannot connect too far elements
StructuralCannotCreateCustomConnection |  Could not create a custom connection.
StructuralCustomConnectionComponentsRelationship |  Cannot create custom connection due to relationships to external elements.
StructuralCustomConnectionEmpty |  Structural Custom Connection cannot be empty.
StructuralCustomConnectionWrongType |  Structural Custom Connection has an inappropriate type assigned.
Top
See Also
Reference
Autodesk.Revit.DB Namespace